## 01

### [DataFrame의 인덱스 다루기 - 1]
- 인덱스 종류 : 행 인덱스, 열 인덱스
- 특정 열을 행 인덱스로 설정하는 방법
- 메서드 : df.set_index(열 인덱스, inplace = False)

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
jumsu = {'name' : ['마징가', '태권V', '원더우먼'],
         'kor'  : [89, 100, 99],
         'eng'  : [70, 80, 90],
         'math' : [99, 88, 77]}

In [3]:
# [3] Dict ==> DataFrame 형태로 저장
df = pd.DataFrame(jumsu)
df

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [6]:
# [4] name 컬럼을 행 인덱스로 설정
df2 = df.set_index('name')
df2

      kor  eng  math
name
마징가    89   70    99
태권V   100   80    88
원더우먼   99   90    77

In [8]:
# DF2 데이터프레임의 행 인덱스/열 인덱스 확인
print(df2.index, df2.columns, sep ='\n')

Index(['마징가', '태권V', '원더우먼'], dtype='object', name='name')
Index(['kor', 'eng', 'math'], dtype='object')

In [11]:
# [5] 데이터 추출
# - '마징가'의 성적 추출 즉, 행 추출 ==> 변수명.loc[] / 변수명.iloc[]
print(df2.loc['마징가'])
print(df2.iloc[0])

kor     89
eng     70
math    99
Name: 마징가, dtype: int64
kor     89
eng     70
math    99
Name: 마징가, dtype: int64

In [14]:
# - '마징가', '원더우먼'의 성적 추출 즉, 행 추출 ==> 변수명.loc[] / 변수명.iloc[]
print(df2.loc[['마징가', '원더우먼']])
print(df2.iloc[[0,2]])

      kor  eng  math
name
마징가    89   70    99
원더우먼   99   90    77
      kor  eng  math
name
마징가    89   70    99
원더우먼   99   90    77

In [19]:
# [6] eng 점수 컬럼을 행 인덱스로 설정
df3 = df.set_index('eng')
df3

     name  kor  math
eng
70    마징가   89    99
80    태권V  100    88
90   원더우먼   99    77

In [18]:
# [7] name, eng 점수 컬럼을 행 인덱스로 설정 => 멀티 인덱스
df4 = df.set_index(['name', 'eng'])
df4

          kor  math
name eng
마징가  70    89    99
태권V  80   100    88
원더우먼 90    99    77

In [20]:
df4.index

MultiIndex([( '마징가', 70),
            ( '태권V', 80),
            ('원더우먼', 90)],
           names=['name', 'eng'])

In [25]:
print(df4.loc['마징가', 70])
print(df4.iloc[0])

kor     89
math    99
Name: (마징가, 70), dtype: int64
kor     89
math    99
Name: (마징가, 70), dtype: int64

## 02

### [DataFrame의 인덱스 다루기 - 2]
- 새로운 행 인덱스를 생성 및 적용
- 메서드 : 변수명.reindex(새로운 인덱스, fill_value)

In [26]:
# [1] 모듈 로딩
import pandas as pd

In [27]:
# [2] 데이터 준비
jumsu = {'name' : ['마징가', '태권V', '원더우먼'],
         'kor'  : [89, 100, 99],
         'eng'  : [70, 80, 90],
         'math' : [99, 88, 77]}

In [32]:
# [3] Dict ==> DataFrame 형태로 저장
df = pd.DataFrame(jumsu)
df

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [35]:
# [4] 행 인덱스를 새롭게 생성
new_index = [0, 1, 2, 'r0', 'r1', 'r2']
df2 = df.reindex(new_index)
df2

    name    kor   eng  math
0    마징가   89.0  70.0  99.0
1    태권V  100.0  80.0  88.0
2   원더우먼   99.0  90.0  77.0
r0   NaN    NaN   NaN   NaN
r1   NaN    NaN   NaN   NaN
r2   NaN    NaN   NaN   NaN

In [37]:
# [5] 행 인덱스를 새롭게 생성 => 존재하지 않는 행에 값 설정
df3 = df.reindex([0, 'r0', 'r1', 2], fill_value = 0)
df3

    name  kor  eng  math
0    마징가   89   70    99
r0     0    0    0     0
r1     0    0    0     0
2   원더우먼   99   90    77

## 03

### [DataFrame의 인덱스 다루기 - 3]
- 행 인덱스를 정수형 인덱스로 초기화
- 기존 행 인덱스 ==> 컬럼으로 추가 시킴[기본값]
- 메서드 : 변수명.reset_index()

In [39]:
# [1] 모듈 로딩
import pandas as pd

In [40]:
# [2] 데이터 준비
jumsu = {'name' : ['마징가', '태권V', '원더우먼'],
         'kor'  : [89, 100, 99],
         'eng'  : [70, 80, 90],
         'math' : [99, 88, 77]}

In [54]:
# [3] Dict ==> DataFrame 형태로 저장
df = pd.DataFrame(jumsu)
df

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [55]:
# [4] 행 인덱스 초기화
df2 = df.reset_index()
df2

   index  name  kor  eng  math
0      0   마징가   89   70    99
1      1   태권V  100   80    88
2      2  원더우먼   99   90    77

In [61]:
print(df2.drop('index', axis = 1))
print('-' * 30)
print(df2.drop(columns = 'index'))

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77
------------------------------
   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [62]:
# [5] 행 인덱스 초기화 ==> 기존 행을 컬럼으로 추가하지 않기
df3 = df.reset_index(drop = True)
df3

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

## 04

### [DataFrame의 인덱스 바꾸기 -4]
- 인덱스 정렬하기
- 기본 : 오름차순
- 메서드 : sort_index

In [67]:
# [1] 모듈 로딩
import pandas as pd

In [68]:
# [2] 데이터 준비
data = {'A' : [98, 78, 100, 52]}

In [70]:
# [3] Dict ==> DataFrame 형태로 저장
df = pd.DataFrame(data, index = [9, 12, 1, 3])
df

      A
9    98
12   78
1   100
3    52

In [73]:
# [4] 행 인덱스 정렬
# - 기본 : 오름차순 정렬 즉, 작은 인덱스 >>>> 큰 인덱스
df.sort_index()

      A
1   100
3    52
9    98
12   78

In [75]:
# - 변경 : 내림차순 정렬 즉, 큰 인덱스 >>>> 작은 인덱스
df.sort_index(ascending=False)

      A
12   78
9    98
3    52
1   100

In [77]:
# [5] 행 인덱스 변경 후 정렬
# 현재 [12, 9, 3, 1] ==> ['A', 'b', 'C', 'd']
df.index = ['A', 'b', 'C', 'd']
df

     A
A   98
b   78
C  100
d   52

In [78]:
df.sort_index()

     A
A   98
C  100
b   78
d   52

In [93]:
df.sort_index(key = lambda x : x.str.lower())

     A
A   98
b   78
C  100
d   52